emacs.org
#+title Emacs configuration via org-babel
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

This is and probably always will be a work in progress! :-) 

* Manual steps
There are some steps that require some manual intervention.

** Aspell - spellcheck

~aspell~ needs to be install via ~brew~ / ~apt~ however!

** lsp 
Installing specfic LSP language servers.
Clojure can be done from within emacs vai ~M-x lsp-install-server~

Some langages require extra setup...

* hacks for osx...
#+begin_src emacs-lisp
  (setq image-types (cons 'svg image-types))
  (add-to-list 'default-frame-alist '(undecorated-round . t))
#+end_src

* Vanilla configuration

#+begin_src emacs-lisp
  ;; Don't show the splash screen
  (setq inhibit-startup-message t)

  ;; flash on error / warnings
  (setq visible-bell t)

  ;; turn off some gui features
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)

  (display-fill-column-indicator-mode -1)

  ;; highlight the current line
  (hl-line-mode t)

  ;; Add some space 
  (set-fringe-mode 10)

  ;; line numbers
  ;; (global-display-line-numbers-mode t)

  ;; show the column in mode line
  (column-number-mode 1)

  ;; wrap lines everywhere
  (global-visual-line-mode 1)

  ;; hide the mode line... lets try this
  ;; (global-hide-mode-line-mode)

  ;; for osx 
   (setq frame-resize-pixelwise t)

  ;; (setq right-margin-width 0)
  ;; (setq left-margin-width 0)

  ;; (set-window-buffer nil (current-buffer))
  (set-face-foreground 'vertical-border "#3b4252")
  (window-divider-mode 0)

  (add-to-list 'default-frame-alist '(internal-border-width . 0))

  ;; keep buffers synced with disc 
  (global-auto-revert-mode 1)

  ;; auto save buffers 
  (auto-save-visited-mode 1)

#+end_src

* Run emcas as a server?
Don't do it this way...
Better to use the --daemon flag
Better still to use systemctl 
#+begin_src emacs-lisp
;;  (server-start)
#+end_src

* Package management

Tell emacs where to search for external packages
#+begin_src emacs-lisp
  ;; Initialize package sources and ensure use-package
  (require 'package)

  (setq package-archives '(("melpa"  . "https://melpa.org/packages/")
  			 ("org"    . "https://orgmode.org/elpa/")
  			 ("elpa"   . "https://elpa.gnu.org/packages/")
  			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (package-initialize) 

  (unless (and package-archive-contents (package-installed-p 'use-package))
    (package-refresh-contents)
    (package-install 'use-package))
    (eval-when-compile (require 'use-package))

  (require 'use-package)
  ;; ensure all use package packages are downlaoded
  (setq use-package-always-ensure t)

  ;; quelpa is a tool to compile and install Emacs Lisp packages locally from local or remote source code. https://github.com/quelpa/quelpa

  (use-package quelpa)

#+end_src

* Theme
Make it look good :-)

I like monokai-theme makes me feel like I'm using sublime text 2 again in university.

#+begin_src emacs-lisp
  (use-package monokai-theme)
  ;;(load-theme 'monokai t)
#+end_src

I really like monokai-theme as the default but with direct light on my monitor it is hard to read. [[https://github.com/doomemacs/themes][Doom themes]] are awesome and provide a choice of lighter themes to swap to when needed.

#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
  	    doom-themes-enable-italic t) ; if nil, italics is universally disabled
    ;; (load-theme 'doom-one-light t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  ;;  (load-theme 'doom-nord t)
  ;;  (load-theme 'doom-gruvbox t)

#+end_src


Dynamic theme with ewal + wallust 
#+begin_src emacs-lisp
  (use-package ewal
    :init (setq ewal-use-built-in-always-p nil
                ewal-use-built-in-on-failure-p t
  	      ewal-json-file "~/.cache/wallust/colors.json"
                ewal-built-in-palette "sexy-material"))

  (use-package ewal-doom-themes
    :ensure t)
  (load-theme 'ewal-doom-one t)
#+end_src    

#+RESULTS:
: t


* Icons!

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))

  ;; (all-the-icons-install-fonts t)
#+end_src

* Mode line

Turns out Doom also has the best easy drop in mode line package with [[https://github.com/seagle0128/doom-modeline#use-package][doom-modeline]]. 
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))
#+end_src

* Start up buffers
What to show when opening Emacs without specifying a file. 

There are packages to define what gets shown when Emacs initially loads. Actually I think I might not actually even need a package I'm sure there is some configuration.

Ideas :
- Agenda + prompt to start a journal entry if there isn't one for the day say far probably via yasnippet or an org capture template
- Something similar to Doom which gives you a few sensible links, recent projects / files etc.
- Email inbox
- Hacker news / Reddit / RSS feed lots of options 




* PATH configuration
Ensure emacs uses the shell path so we can access user bins
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
     :config (exec-path-from-shell-initialize))
#+end_src

* Ivy completion - via counsel

Ivy is a completion framework which provies a lot of extra functionality / niceness over the default ido. 

Counsel and Swiper are built on top of Ivy. Swiper is for searching and Ivy provides a completion framework. 

#+begin_src emacs-lisp
  (use-package counsel)
  (ivy-mode 1) ;; Ivy completion everywhere

  ;;;; recomended defaults - https://oremacs.com/swiper/#basic-customization
  (setq ivy-use-virtual-buffers "recentf")
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-use-selectable-prompt t)
  (setq enable-recursive-minibuffers t)
  
  ;;;; recomended counsel/ivy/swiper  key bindings
  (global-set-key (kbd "C-s") 'swiper-isearch)
  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "C-x C-f") 'counsel-find-file)
  (global-set-key (kbd "M-y") 'counsel-yank-pop)
  (global-set-key (kbd "<f1> f") 'counsel-describe-function)
  (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
  (global-set-key (kbd "<f1> l") 'counsel-find-library)
  (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
  (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
  (global-set-key (kbd "<f2> j") 'counsel-set-variable)
  (global-set-key (kbd "C-x b") 'counsel-switch-buffer)
  (global-set-key (kbd "C-c v") 'ivy-push-view)
  (global-set-key (kbd "C-c V") 'ivy-pop-view)

#+end_src

* Rich annotations with Marginalia
Add a desecration / summary of the commands shown in the mini buffer.
#+begin_src emacs-lisp
  (use-package marginalia
    ;; Either bind `marginalia-cycle` globally or only in the minibuffer
    :bind (("M-A" . marginalia-cycle)
	   :map minibuffer-local-map
	   ("M-A" . marginalia-cycle))

    ;; The :init configuration is always executed (Not lazy!)
    :init
    ;; Must be in the :init section of use-package such that the mode gets
    ;; enabled right away. Note that this forces loading the package.
    (marginalia-mode))
#+end_src

* Which key - suggest key chord completion
Opens the mini buffer with suggestions of what valid key chords are available 
#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :diminish which-key-modeq
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))
#+end_src

* Projectile - project management
Emacs project management tools based on version control or certain build tools like package.json I believe. 
https://docs.projectile.mx/projectile/index.html
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :diminish projectile-mode
    :init
    (projectile-mode +1)
    :bind (:map projectile-mode-map
		("C-c p" . projectile-command-map))
    :init
    (setq projectile-project-search-path '("~/Projects/")))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+end_src

** TODO counsel keybindings not properly set up

* Magit - git wrapper

Emacs does Git really well with Magit. 

#+begin_src emacs-lisp
  (use-package magit
       :bind ("C-x g" . magit-status)
       :commands (magit-status magit-get-current-branch))
#+end_src

* flycheck - linting / syntax checkisng etc
https://www.flycheck.org/en/latest/
#+begin_src emacs-lisp
  (use-package flycheck
    :init (global-flycheck-mode))

#+end_src

* Spellchecking

Please fix my dyslexia computer! 

#+begin_src emacs-lisp
  (add-hook 'text-mode-hook 'flyspell-mode)
  (add-hook 'prog-mode-hook 'flyspell-prog-mode)

  (setq ispell-dictionary "en_GB")
  (setq ispell-program-name "aspell")
  (setq ispell-silently-savep t)

  (use-package flyspell-correct
    :after flyspell
    :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

  (use-package flyspell-correct-ivy
    :after flyspell-correct)

  (use-package flyspell-correct-popup
    :after flyspell-correct)
#+end_src


* Tree sitter

This is straight form [[https://github.com/mickeynp/combobulate][combobulate]]

#+begin_src emacs-lisp

  (use-package treesit-auto
    :ensure t
    :commands global-treesit-auto-mode
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode +1))


  (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.jsx\\'" . tsx-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.js\\'" . typescript-ts-mode))
#+end_src

