init.el
(setq image-types (cons 'svg image-types))
(add-to-list 'default-frame-alist '(undecorated-round . t))

;; Don't show the splash screen
(setq inhibit-startup-message t)

;; flash on error / warnings
(setq visible-bell t)

;; turn off some gui features
(tool-bar-mode -1)
(scroll-bar-mode -1)
(menu-bar-mode -1)

(display-fill-column-indicator-mode -1)

;; highlight the current line
(hl-line-mode t)
;; Add some space 
(set-fringe-mode 0)

;; line numbers
;; (global-display-line-numbers-mode t)

;; show the column in mode line
(column-number-mode 1)

;; wrap lines everywhere
(global-visual-line-mode 1)

;; hide the mode line... lets try this
;; (global-hide-mode-line-mode)

;; for osx 
 (setq frame-resize-pixelwise t)

;; (setq right-margin-width 0)
;; (setq left-margin-width 0)

;; (set-window-buffer nil (current-buffer))
(set-face-foreground 'vertical-border "#3b4252")
(window-divider-mode 0)


(add-to-list 'default-frame-alist '(internal-border-width . 10))
(add-to-list 'default-frame-alist '(alpha 90 90))


;; keep buffers synced with disc 
(global-auto-revert-mode 1)

;; auto save buffers 
(auto-save-visited-mode 1)

;;  (server-start)

;; Initialize package sources and ensure use-package
(require 'package)

(setq package-archives '(("melpa"  . "https://melpa.org/packages/")
			 ("org"    . "https://orgmode.org/elpa/")
			 ("elpa"   . "https://elpa.gnu.org/packages/")
			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

(package-initialize) 

(unless (and package-archive-contents (package-installed-p 'use-package))
  (package-refresh-contents)
  (package-install 'use-package))
  (eval-when-compile (require 'use-package))

(require 'use-package)
;; ensure all use package packages are downlaoded
(setq use-package-always-ensure t)

;; quelpa is a tool to compile and install Emacs Lisp packages locally from local or remote source code. https://github.com/quelpa/quelpa

(use-package quelpa)

(use-package monokai-theme)
;;(load-theme 'monokai t)

(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	    doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; (load-theme 'doom-one-light t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

;;  (load-theme 'doom-nord t)
;;  (load-theme 'doom-gruvbox t)

(use-package ewal
  :init (setq ewal-use-built-in-always-p nil
              ewal-use-built-in-on-failure-p t
	      ewal-json-file "~/.cache/wallust/colors.json"
              ewal-built-in-palette "sexy-material"))

(use-package ewal-doom-themes
  :ensure t)
(load-theme 'ewal-doom-one t)

(use-package all-the-icons
  :if (display-graphic-p))

;; (all-the-icons-install-fonts t)

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))

(use-package exec-path-from-shell
   :config (exec-path-from-shell-initialize))

(use-package counsel)
(ivy-mode 1) ;; Ivy completion everywhere

;;;; recomended defaults - https://oremacs.com/swiper/#basic-customization
(setq ivy-use-virtual-buffers "recentf")
(setq ivy-count-format "(%d/%d) ")
(setq ivy-use-selectable-prompt t)
(setq enable-recursive-minibuffers t)

;;;; recomended counsel/ivy/swiper  key bindings
(global-set-key (kbd "C-s") 'swiper-isearch)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "M-y") 'counsel-yank-pop)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "<f2> j") 'counsel-set-variable)
(global-set-key (kbd "C-x b") 'counsel-switch-buffer)
(global-set-key (kbd "C-c v") 'ivy-push-view)
(global-set-key (kbd "C-c V") 'ivy-pop-view)

(use-package marginalia
  ;; Either bind `marginalia-cycle` globally or only in the minibuffer
  :bind (("M-A" . marginalia-cycle)
	   :map minibuffer-local-map
	   ("M-A" . marginalia-cycle))

  ;; The :init configuration is always executed (Not lazy!)
  :init
  ;; Must be in the :init section of use-package such that the mode gets
  ;; enabled right away. Note that this forces loading the package.
  (marginalia-mode))

(use-package which-key
  :defer 0
  :diminish which-key-modeq
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(use-package projectile
  :ensure t
  :diminish projectile-mode
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
		("C-c p" . projectile-command-map))
  :init
  (setq projectile-project-search-path '("~/Kroo/")))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package magit
     :bind ("C-x g" . magit-status)
     :commands (magit-status magit-get-current-branch))

(use-package flycheck
  :init (global-flycheck-mode))

(add-hook 'text-mode-hook 'flyspell-mode)
(add-hook 'prog-mode-hook 'flyspell-prog-mode)

(setq ispell-dictionary "en_GB")
(setq ispell-program-name "aspell")
(setq ispell-silently-savep t)

(use-package flyspell-correct
  :after flyspell
  :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

(use-package flyspell-correct-ivy
  :after flyspell-correct)

(use-package flyspell-correct-popup
  :after flyspell-correct)
