emacs.org
* LSP mode - IDE features

#+begin_src emacs-lisp
(use-package yaml-mode)  
#+end_src


#+begin_src emacs-lisp
  (use-package lsp-mode
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l"
  	gc-cons-threshold 100000000
  	read-process-output-max (* 1024 1024))
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
  	 (lsp-mode . lsp-diagnostics-mode)
  	 (clojure-mode . lsp)
  	 (terraform-mode . lsp)
  	 ((tsx-ts-mode typescript-ts-mode js-ts-mode) . lsp-deferred)
  	 ;; if you want which-key integration
  	 (lsp-mode . lsp-enable-which-key-integration)
  	 )
    :commands lsp)

  ;; optionally
  (use-package lsp-ui :commands lsp-ui-mode)
  ;; if you are ivy user
  (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
  (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

  ;; optionally if you want to use debugger
  ;;  (use-package dap-mode)
  ;; (use-package dap-LANGUAGE) to load the dap adapter for your language

  ;; (lsp-install-server nil 'clojure-lsp)

#+end_src

* Yasnippet
[[https://joaotavora.github.io/yasnippet/][Yet another snippet extension]]

#+begin_quote
YASnippet is a template system for Emacs. It allows you to type an abbreviation and automatically expand it into function templates.
#+end_quote

#+begin_src emacs-lisp
  (use-package yasnippet)
  (use-package yasnippet-snippets)

  (yas-global-mode 1)
#+end_src

* Clojure packages
                             
#+begin_src emacs-lisp
  (use-package rainbow-delimiters)
  (use-package smartparens)
  (use-package idle-highlight-mode) 
  (use-package flycheck-clojure)
  (use-package flycheck-clj-kondo)

  (use-package flycheck-pos-tip
    :after flycheck)

  (eval-after-load 'flycheck
    '(setq flycheck-display-errors-function #'flycheck-pos-tip-error-messages))


  (use-package flycheck-clojure
    :defer t
    :commands (flycheck-clojure-setup)               ;; autoload
    :config
    (eval-after-load 'flycheck
      '(setq flycheck-display-errors-function #'flycheck-pos-tip-error-messages))
    (add-hook 'after-init-hook #'global-flycheck-mode))

  (use-package clojure-mode
    :config
    (require 'flycheck-clj-kondo)
    :mode (("\\.clj\\'" . clojure-mode)
	   ("\\.edn\\'" . clojure-mode))
    :init
    (add-hook 'clojure-mode-hook #'subword-mode)           
    (add-hook 'clojure-mode-hook #'smartparens-mode)       
    (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'clojure-mode-hook #'eldoc-mode)             
    (add-hook 'clojure-mode-hook #'idle-highlight-mode))

  (use-package clj-refactor
    :defer t
    :ensure t
    :diminish clj-refactor-mode
    :config (cljr-add-keybindings-with-prefix "C-c C-m"))

  (use-package cider
    :ensure t
    :defer t
    :init (add-hook 'cider-mode-hook #'clj-refactor-mode)
    :diminish subword-mode
    :config
    (setq nrepl-log-messages t                  
	  cider-repl-use-clojure-font-lock t    
	  cider-prompt-save-file-on-load 'always-save
	  cider-font-lock-dynamically '(macro core function var)
	  nrepl-hide-special-buffers t            
	  cider-overlays-use-font-lock t)
    (flycheck-clojure-setup)
    (cider-repl-toggle-pretty-printing))
#+end_src

* Org mode - very meta!!!

[[https://orgmode.org/][Org Mode]] is really hard to describe as it does /a lot/ and has a load of extensions.  At it's core Org Mode is an outlining tool.  It defines headers that you can nest and open / collapse.  Built on top of that is a system for scheduling, having different work states like TODO / DONE etc, agendas and exporting files to different formats.  Org sort of does a bit of everything. 

** Fundamental key binds 
#+begin_src emacs-lisp
  ;; org-mode
  (use-package org)
  (global-set-key (kbd "C-c l") #'org-store-link)
  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)

#+end_src

** Org agenda path

#+begin_src emacs-lisp
  (setq org-agenda-files (directory-files-recursively "~/org/" "\\.org$"))
#+end_src


** Org todo keywords
#+begin_src emacs-lisp
  (setq org-todo-keywords
  	'((sequence "INBOX(i)" "TODO(t)" "WAIT(w@/!)" "BLOG(b)" "PROJECT(p)" "AREA(a)" "READ(r)" "|" "DONE(d!)" "CANCELED(c@)")))
  (setq org-log-done 'time)

#+end_src

** Org refile
Moving headlines around

#+begin_src emacs-lisp
  (setq org-refile-targets '(("~/org/personal/personal.org" :maxlevel . 2)))
#+end_src

** Org Babel
Languages to load 
#+begin_src emacs-lisp
  (eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((clojure . t)
     (emacs-lisp . t)
     (shell . t))))
#+end_src

Org Babel Clojure back-end - defer to cider which requires jack in 
#+begin_src emacs-lisp
  (setq org-babel-clojure-backend 'cider)
#+end_src

Auto tangle - saves you needing to explicitly tangle org files. 
#+begin_src emacs-lisp
  (use-package org-auto-tangle
   :defer t
   :hook (org-mode . org-auto-tangle-mode))

  (setq org-auto-tangle-default t)
#+end_src

** Org modern - styling package

#+begin_src emacs-lisp
  ;;;; org modern - clean theme 
  (use-package org-modern
    :init
    (add-hook 'org-mode-hook #'org-modern-mode)
    (add-hook 'org-agenda-finalize-hook #'org-modern-agenda))

  ;; Choose some fonts
  (set-face-attribute 'default nil :family "Hack Nerd Font Mono"  :height 110)
  (set-face-attribute 'variable-pitch nil :family "Hack Nerd Font" :height 110)
  (set-face-attribute 'org-modern-symbol nil :family "Hack Nerd Font Mono" :height 110)

  (modify-all-frames-parameters '((right-divider-width . 40)))
  (dolist (face '(window-divider
  		window-divider-first-pixel
  		window-divider-last-pixel))
    (face-spec-reset-face face)
    (set-face-foreground face (face-attribute 'default :background)))
  (set-face-background 'fringe (face-attribute 'default :background))

  (setq
   ;; Edit settings
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   org-ellipsis " ↯"

   ;; Agenda styling
   org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   " now ─────────────────────────────────────────────────")


  (set-face-foreground 'vertical-border "#3b4252")
  (window-divider-mode 0)

#+end_src

** Inline images
Don't use the real image width for inline images - images are rendered WAAAAAY too large to be useful in org files. 
#+begin_src emacs-lisp
  (setq org-image-actual-width 400)
#+end_src

** Centre text while working with org files
#+begin_src emacs-lisp

  (use-package visual-fill-column
    :hook (org-mode .  (lambda ()
			 (setq visual-fill-column-width 100
			       visual-fill-column-center-text t)
			 (visual-fill-column-mode 1)
			 )))

  #+end_src

** Org Kanban
#+begin_src emacs-lisp
  (use-package org-kanban)
#+end_src

** Capture Templates

#+begin_src emacs-lisp

  (setq org-capture-templates
        '(("i" "Inbox" entry (file+headline "~/org/personal/personal.org" "Inbox")
  	   "* INBOX %?
  :PROPERTIES:
  :CAPTURED: %U
  :END:
    " :empty-lines 1)
  	("r" "Read" entry (file+headline "~/org/personal/personal.org" "Reading List")
  	 "* READ %?
  :PROPERTIES:
  :CAPTURED: %U
  :END:
    " :empty-lines 1)
  	("p" "Project [0/2]" entry (file+headline "~/org/personal/personal.org" "Projects")
  	   "* PROJECT %? :projectTag: \nDEADLINE: %t \n:PROPERTIES: \n:CAPTURED: %U \n:END: \n** INBOX first task\n** INBOX second task
    " :empty-lines 1)
  	  ("j" "Journal" entry (file+olp+datetree "~/org/personal/journal.org")
  	   "* %?\nEntered on %U\n  %i\n" :empty-lines 1)
  	  ("J" "Journal entry at time" entry (file+olp+datetree "~/org/personal/journal.org")
  	   "* %T %?\n%i\n" :time-prompt t :empty-lines 1)

  	  ("w" "work")
  	  ("wj" "Work Journal" entry (file+olp+datetree "~/org/work/kroo-journal.org")
  	   "* %?\nEntered on %U\n  %i\n" :empty-lines 1)
  	  ("wJ" "Work Journal entry at time" entry (file+olp+datetree "~/org/work/kroo-journal.org")
  	   "* %T %?\n%i\n%a" :time-prompt t :empty-lines 1)
  	  ("wt" "Work Ticket" entry (file+headline "~/org/work/kroo-journal.org" "Tickets")
  	   "* TODO  %?\nEntered on %U\n  %i\n  %a" :empty-lines 1)
      ))


#+end_src

