init.el

(use-package yaml-mode)

(use-package lsp-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l"
	  gc-cons-threshold 100000000
	  read-process-output-max (* 1024 1024))
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
	   (clojure-mode . lsp)
	   (terraform-mode . lsp)
	   ;; if you want which-key integration
	   (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode)
;; if you are ivy user
(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
;;  (use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

;; (lsp-install-server nil 'clojure-lsp)

(use-package yasnippet)
(use-package yasnippet-snippets)

(yas-global-mode 1)

(use-package rainbow-delimiters)
(use-package smartparens)
(use-package idle-highlight-mode) 
(use-package flycheck-clojure)
(use-package flycheck-clj-kondo)

(use-package flycheck-pos-tip
  :after flycheck)

(eval-after-load 'flycheck
  '(setq flycheck-display-errors-function #'flycheck-pos-tip-error-messages))


(use-package flycheck-clojure
  :defer t
  :commands (flycheck-clojure-setup)               ;; autoload
  :config
  (eval-after-load 'flycheck
    '(setq flycheck-display-errors-function #'flycheck-pos-tip-error-messages))
  (add-hook 'after-init-hook #'global-flycheck-mode))

(use-package clojure-mode
  :config
  (require 'flycheck-clj-kondo)
  :mode (("\\.clj\\'" . clojure-mode)
	   ("\\.edn\\'" . clojure-mode))
  :init
  (add-hook 'clojure-mode-hook #'subword-mode)           
  (add-hook 'clojure-mode-hook #'smartparens-mode)       
  (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'clojure-mode-hook #'eldoc-mode)             
  (add-hook 'clojure-mode-hook #'idle-highlight-mode))

(use-package clj-refactor
  :defer t
  :ensure t
  :diminish clj-refactor-mode
  :config (cljr-add-keybindings-with-prefix "C-c C-m"))

(use-package cider
  :ensure t
  :defer t
  :init (add-hook 'cider-mode-hook #'clj-refactor-mode)
  :diminish subword-mode
  :config
  (setq nrepl-log-messages t                  
	  cider-repl-use-clojure-font-lock t    
	  cider-prompt-save-file-on-load 'always-save
	  cider-font-lock-dynamically '(macro core function var)
	  nrepl-hide-special-buffers t            
	  cider-overlays-use-font-lock t)
  (flycheck-clojure-setup)
  (cider-repl-toggle-pretty-printing))

;; org-mode
(use-package org)
(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)

(setq org-agenda-files (directory-files-recursively "~/org/" "\\.org$"))

(setq org-todo-keywords
	'((sequence "INBOX(i)" "TODO(t)" "WAIT(w@/!)" "BLOG(b)" "PROJECT(p)" "AREA(a)" "READ(r)" "|" "DONE(d!)" "CANCELED(c@)")))
(setq org-log-done 'time)

(setq org-refile-targets '(("~/org/personal/personal.org" :maxlevel . 2)))

(eval-after-load 'org
(org-babel-do-load-languages
 'org-babel-load-languages
 '((clojure . t)
   (emacs-lisp . t)
   (shell . t))))

(setq org-babel-clojure-backend 'cider)

(use-package org-auto-tangle
 :defer t
 :hook (org-mode . org-auto-tangle-mode))

(setq org-auto-tangle-default t)

;;;; org modern - clean theme 
(use-package org-modern
  :init
  (add-hook 'org-mode-hook #'org-modern-mode)
  (add-hook 'org-agenda-finalize-hook #'org-modern-agenda))

;; Choose some fonts
(set-face-attribute 'default nil :family "Hack Nerd Font Mono"  :height 110)
(set-face-attribute 'variable-pitch nil :family "Hack Nerd Font" :height 110)
(set-face-attribute 'org-modern-symbol nil :family "Hack Nerd Font Mono" :height 110)

(modify-all-frames-parameters '((right-divider-width . 40)))
(dolist (face '(window-divider
		window-divider-first-pixel
		window-divider-last-pixel))
  (face-spec-reset-face face)
  (set-face-foreground face (face-attribute 'default :background)))
(set-face-background 'fringe (face-attribute 'default :background))

(setq
 ;; Edit settings
 org-auto-align-tags nil
 org-tags-column 0
 org-catch-invisible-edits 'show-and-error
 org-special-ctrl-a/e t
 org-insert-heading-respect-content t

 ;; Org styling, hide markup etc.
 org-hide-emphasis-markers t
 org-pretty-entities t
 org-ellipsis " ↯"

 ;; Agenda styling
 org-agenda-tags-column 0
 org-agenda-block-separator ?─
 org-agenda-time-grid
 '((daily today require-timed)
   (800 1000 1200 1400 1600 1800 2000)
   " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
 org-agenda-current-time-string
 " now ─────────────────────────────────────────────────")


(set-face-foreground 'vertical-border "#3b4252")
(window-divider-mode 0)

(setq org-image-actual-width 400)

(use-package visual-fill-column
  :hook (org-mode .  (lambda ()
			 (setq visual-fill-column-width 100
			       visual-fill-column-center-text t)
			 (visual-fill-column-mode 1)
			 )))

(use-package org-kanban)

(setq org-capture-templates
      '(("i" "Inbox" entry (file+headline "~/org/personal/personal.org" "Inbox")
	   "* INBOX %?
:PROPERTIES:
:CAPTURED: %U
:END:
  " :empty-lines 1)
	("r" "Read" entry (file+headline "~/org/personal/personal.org" "Reading List")
	 "* READ %?
:PROPERTIES:
:CAPTURED: %U
:END:
  " :empty-lines 1)
	("p" "Project [0/2]" entry (file+headline "~/org/personal/personal.org" "Projects")
	   "* PROJECT %? :projectTag: \nDEADLINE: %t \n:PROPERTIES: \n:CAPTURED: %U \n:END: \n** INBOX first task\n** INBOX second task
  " :empty-lines 1)
	  ("j" "Journal" entry (file+olp+datetree "~/org/personal/journal.org")
	   "* %?\nEntered on %U\n  %i\n" :empty-lines 1)
	  ("J" "Journal entry at time" entry (file+olp+datetree "~/org/personal/journal.org")
	   "* %T %?\n%i\n" :time-prompt t :empty-lines 1)

	  ("w" "work")
	  ("wj" "Work Journal" entry (file+olp+datetree "~/org/work/kroo-journal.org")
	   "* %?\nEntered on %U\n  %i\n" :empty-lines 1)
	  ("wJ" "Work Journal entry at time" entry (file+olp+datetree "~/org/work/kroo-journal.org")
	   "* %T %?\n%i\n%a" :time-prompt t :empty-lines 1)
	  ("wt" "Work Ticket" entry (file+headline "~/org/work/kroo-journal.org" "Tickets")
	   "* TODO  %?\nEntered on %U\n  %i\n  %a" :empty-lines 1)
    ))
