init.el

;; Populates only the EXPORT_FILE_NAME property in the inserted heading.
(with-eval-after-load 'org-capture
  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
See `org-capture-templates' for more information."
    (let* ((title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
	   (description (read-from-minibuffer "Post Description: ")) ;Prompt to enter the post description
	   (fname (org-hugo-slug (concat (format-time-string "%d-%m-%Y") "-" title))))
      (mapconcat #'identity
		 `(
		   ,(concat "* TODO " title)
		   ":PROPERTIES:"
		   ,(concat ":EXPORT_FILE_NAME: " fname)
		   ,(concat ":EXPORT_DESCRIPTION: " description)
		   ":END:"
		   "%?\n")          ;Place the cursor here 
		 "\n")))

  (add-to-list 'org-capture-templates
	       '("h" "Hugo post"))
  (add-to-list 'org-capture-templates    
	       '("hc" "Coding Clojure"
		 entry
		 (file+olp "~/org/blog-posts/coding-clojure/coding-clojure.org" "posts")
		 (function org-hugo-new-subtree-post-capture-template)))
  (add-to-list 'org-capture-templates    
		 '("ht" "they.es"
		   entry
		   (file+olp "~/org/blog-posts/they.es/theyes-blog.org" "Blog Section")
		   (function org-hugo-new-subtree-post-capture-template)
		   :prepend t)))

;; export to hugo 
(use-package ox-hugo
  :pin melpa 
  :after ox)

(setq org-hugo-external-file-extensions-allowed-for-copying
  '("jpg" "jpeg" "tiff" "png" "svg" "gif" "bmp" "mp4" "pdf" "odt" "doc"
    "ppt" "xls" "docx" "pptx" "xlsx" "webp"))

(use-package ox-twbs)

(use-package org-roam
  :custom
  (org-roam-directory (file-truename "~/org/roam/"))
  (org-roam-capture-templates
   '(("d" "default" plain
	"%?"
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title} \n\n\n#+print_bibliography:")
	:unnarrowed t)))
  :bind (("C-c n l" . org-roam-buffer-toggle)
	   ("C-c n f" . org-roam-node-find)
	   ("C-c n g" . org-roam-graph)
	   ("C-c n i" . org-roam-node-insert)
	   ("C-c n c" . org-roam-capture)
	   ;; Dailies
	   ("C-c n j" . org-roam-dailies-capture-today))
  :config
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  ;; If using org-roam-protocol
  ;;(require 'org-roam-protocol)
  )

(use-package org-roam-ui

  :after org-roam
  ;; normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;; a hookable mode anymore, you're advised to pick something yourself
  ;; if you don't care about startup time, use
  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
	  org-roam-ui-follow t
	  org-roam-ui-update-on-save t
	  org-roam-ui-open-on-start t))

(require 'oc-natbib)
(require 'oc-biblatex)
(setq org-cite-export-processors '((latex biblatex)
				     (t basic)))
(setq org-cite-global-bibliography '("~/org/roam/references/master-lib.bib"))

(use-package citeproc)

(use-package vterm
  :custom
  (vterm-always-compile-module t))

(use-package hide-mode-line)

(use-package multi-vterm
  :config
  (add-hook 'vterm-mode-hook
	      (lambda () 
		(hide-mode-line-mode)
		)))
